{
    "writer": "Tom Malloy",
    "title": "Bad Ass Girls",
    "logline": "",
    "synopsis": "",
    "accolades": "",
    "financing": {
        "budget": "$1.5 million",
        "equityRaised": "~$2.0 million",
        "mgCommitments": "$1.0 million",
        "financingNotes": "We are looking for a co-financier to help us get the film made. We have a $1.0 million line of credit with our Lender which we can access if we need to.",
        "shootingLocation": "Los Angeles, CA",
        "estimatedTaxCredit": "$300,000",
        "projections_file_path": null
    },
    "attachments": [],
    "agreeToShare": false,
    "agreedToTerms": false,
    "coverage_report": {
        "logline": "When a group of wronged women, each with unique fighting skills and a vendetta against the men who hurt them, unite under the guidance of a mysterious news anchor, they unleash a wave of violent justice across Los Angeles, targeting corrupt criminals and powerful figures, all while evading a determined police force.",
        "analysis": {
            "comps": [
                "Kill Bill Vol. 1 & 2",
                "Faster Pussycat! Kill! Kill!",
                "Sin City",
                "Machete",
                "Bitch Slap"
            ],
            "theme": "The script explores themes of revenge, justice, and female empowerment through the lens of over-the-top action and dark humor. It examines the lasting impact of trauma and abuse, and how individuals can take extreme measures to rectify past wrongs. The script also touches upon the corrupting influence of power and the cyclical nature of violence, suggesting that even those who seek justice can become entangled in a web of brutality.\n\nThe narrative questions the traditional notions of law enforcement and explores the idea of vigilante justice, particularly when the system fails or is complicit in the very crimes it should be preventing. It also highlights the power of perception and manipulation, as seen with Scarlet's character, who uses her public persona to mask her true identity and orchestrate her own brand of justice. There is a running theme of how the media, particularly the news, both shapes and reflects public perception, and can be used as a tool for both good and evil. The script also has an underlying theme of the importance of female solidarity and the strength that comes from a shared sense of injustice.",
            "strengths": "The script's primary strength lies in its bold and unapologetic approach to genre conventions. The characters are larger-than-life, the action is over-the-top, and the dialogue is sharp and witty. The script successfully blends elements of action, crime, and dark comedy, creating a unique and engaging tone. The three main female leads, Ruby, Pleather, and Ink, are all strong, memorable characters with distinct personalities and motivations. Their backstories are intriguing and provide a solid foundation for their actions. The structure of the story, with its flashbacks, intercutting scenes, and multiple storylines, keeps the narrative moving at a brisk pace. The mystery surrounding the Interrogator and his connection to the events adds a layer of intrigue. The script is also highly visual, with numerous opportunities for dynamic action sequences and stylized cinematography.\n\nFurthermore, the script excels at creating memorable moments and quotable lines. The dialogue is often funny, edgy, and occasionally absurd, which helps to offset the darker themes and keep the audience entertained. The script also benefits from its strong sense of style and its willingness to embrace the tropes of B-movie action cinema. The introduction of each character with their respective title cards is a fun and effective way to set the stage for their individual stories. The scenes of violence, while often extreme, are presented in a way that is both shocking and darkly humorous. The character of Scarlet, in particular, is a compelling and complex figure who manages to be both a charming newscaster and a ruthless vigilante, which is a great hook.",
            "challenges_weaknesses": "The script suffers from several significant challenges and weaknesses. The plot, while initially intriguing, becomes convoluted and difficult to follow as it introduces multiple characters and storylines. The Interrogator's identity is revealed too late, and his motivations are unclear until the very end. The Chief being the Interrogator feels like a rushed reveal.\n\n*  The dialogue, while often witty, can also be overly expositional and unnatural. The characters sometimes state their motivations and feelings rather than demonstrating them through action. Many characters also tend to monologue, which slows the pace and makes the dialogue feel forced.\n*  The tone of the script is inconsistent, shifting erratically between dark comedy, over-the-top action, and moments of genuine pathos. This tonal whiplash can be jarring for the audience.\n*  The plot relies on numerous coincidences and contrivances, which weaken the suspension of disbelief. For example, the numerous connections between the characters, the Interrogator's connection to everyone, and the fact that everyone seems to know each other feels forced.\n*  The script's portrayal of violence is often gratuitous and excessive, which could be off-putting to some viewers. The violence is presented in a way that is both shocking and humorous, which may not resonate with all audiences.\n*  Some of the characters, particularly the male characters, are underdeveloped and stereotypical. The Interrogator, while menacing, lacks depth, and the other male characters are often cartoonish villains or pathetic victims. The character of Casey, the aspiring filmmaker, is particularly absurd and serves more as a plot device than a fully realized character. The character of the Rookie is also a bit too much of a caricature, which is a shame, as he could have been an interesting foil to Tony.\n*  The pacing of the script is uneven. The first act is slow, while the second and third acts are too fast. Certain scenes, such as the dogfight, are overly long, while others are rushed. Some of the plot threads are also underdeveloped, such as Pleather's animal activism, which feels tacked on and doesn't have much to do with the main story.\n* The script attempts to make statements about female empowerment, but also relies on stereotypes and objectification. Some of the characters' actions, while meant to be empowering, can come across as overly violent and gratuitous. This can make the characters, at times, seem more like caricatures than fully rounded people."
        },
        "commentary": "This script, \"Bad Ass Girls,\" attempts to blend action, vigilante justice, and a touch of dark humor, but ultimately fails to deliver a compelling or original narrative. The plot, revolving around three women seeking revenge for past traumas, feels derivative of countless other revenge flicks, lacking a unique voice or perspective. The dialogue is often clunky and exposition-heavy, relying on tired tropes and clichés rather than authentic character interactions. The characters themselves are thinly drawn stereotypes: the hardened biker, the animal-loving vigilante, and the tattooed tough girl, all lacking depth and nuance.\n\nThe script suffers from an identity crisis, never quite deciding if it wants to be a serious action film or a campy B-movie. This tonal inconsistency undermines any sense of dramatic tension or emotional investment. The constant use of flashbacks and intercuts feels haphazard and poorly integrated, disrupting the narrative flow rather than enhancing it. The violence, while frequent, is often gratuitous and lacks any real impact. Furthermore, the script relies on tired tropes, such as the mysterious 'Interrogator', and the 'Chief of Police' being the bad guy. The introduction of a plethora of characters, many of whom are quickly killed off, makes it difficult to track who is who or to care about their fate. The central concept of the women being a vigilante group also falls flat because it is not explored in any meaningful way. The script introduces the concept but then fails to delve into the psychology of the group or the ethics of their actions. The ending is abrupt and unsatisfying, leaving many questions unanswered and undermining any sense of closure. Overall, this script is a poorly constructed, unoriginal, and ultimately forgettable attempt at the action genre, unlikely to resonate with audiences or critics. It does not hold its own in comparison to better films of the genre.",
        "evaluation": {
            "rawData": [
                {
                    "scores": {
                        "story": 35,
                        "title": 60,
                        "dialogue": 45,
                        "structure": 40,
                        "characters": 40,
                        "commerciality": 50,
                        "visual_elements": 55
                    }
                },
                {
                    "ratings": {
                        "story": "Fair",
                        "title": "Good",
                        "dialogue": "Fair",
                        "structure": "Fair",
                        "characters": "Fair",
                        "commerciality": "Fair",
                        "visual_elements": "Good"
                    }
                },
                {
                    "scores": {
                        "story": 30,
                        "title": 50,
                        "dialogue": 45,
                        "structure": 40,
                        "characters": 40,
                        "commerciality": 40,
                        "visual_elements": 50
                    },
                    "ratings": {
                        "story": "Poor",
                        "title": "Fair",
                        "dialogue": "Fair",
                        "structure": "Fair",
                        "characters": "Fair",
                        "commerciality": "Fair",
                        "visual_elements": "Fair"
                    }
                },
                {
                    "scores": {
                        "story": 40,
                        "title": 30,
                        "dialogue": 45,
                        "structure": 50,
                        "characters": 45,
                        "commerciality": 60,
                        "visual_elements": 60
                    }
                },
                {
                    "ratings": {
                        "story": "Fair",
                        "title": "Poor",
                        "dialogue": "Fair",
                        "structure": "Fair",
                        "characters": "Fair",
                        "commerciality": "Good",
                        "visual_elements": "Good"
                    }
                },
                {
                    "scores": {
                        "story": 35,
                        "title": 60,
                        "dialogue": 45,
                        "structure": 40,
                        "characters": 40,
                        "commerciality": 55,
                        "visual_elements": 60
                    }
                },
                {
                    "ratings": {
                        "story": "Fair",
                        "title": "Good",
                        "dialogue": "Fair",
                        "structure": "Fair",
                        "characters": "Fair",
                        "commerciality": "Fair",
                        "visual_elements": "Good"
                    }
                },
                {
                    "scores": {
                        "story": 25,
                        "title": 40,
                        "dialogue": 45,
                        "structure": 40,
                        "characters": 40,
                        "commerciality": 50,
                        "visual_elements": 50
                    },
                    "ratings": {
                        "story": "Poor",
                        "title": "Fair",
                        "dialogue": "Fair",
                        "structure": "Fair",
                        "characters": "Fair",
                        "commerciality": "Fair",
                        "visual_elements": "Fair"
                    }
                }
            ]
        },
        "short_synopsis": "The story opens with a news report, where a visibly shaken Miranda Kent, a news anchor, addresses a recent tragedy at her station. The scene then flashes back to the previous day where a brutal interrogation takes place. A man named Carlos, who has been beaten, is forced to recount a story involving a woman named Ruby. This story leads to a flashback of a young Ruby, who is victimized by an older boy named Chulo, who steals her new tricycle. This event is shown to be the catalyst for the rage that drives Ruby.\n\nIn the present day, Ruby has grown into a hardened, leather-clad woman. She enters a seedy bar where she encounters Carlos, the bartender. She also spots a man named Pappi Chulo, who is revealed to be her childhood tormentor. Enraged, Ruby leaves to retrieve a shotgun, and returns to the bar to take her revenge. She kills Chulo's bodyguards and one of the women at his table, but Chulo himself has already left. She learns his location from the surviving woman and sets out to confront him. The narrative then shifts to another woman, Pleather, who works at a pet store and is secretly a vigilante who rescues abused animals. She gets her weapons from a contact named Franco. She tortures a research scientist who practices vivisection on animals. She is then questioned by Sergeant Tony Catone and his rookie partner. Later, she ends up at a dogfighting tournament where she confronts her enemies, including a man she owes money to named Tino, and a powerful mobster known as 'The Don'. Pleather unleashes her fury, killing everyone at the dogfight.\n\nThe story introduces another woman named Ink, a tattooed woman who punishes men who hurt women, by tattooing their crimes on their foreheads. She targets Darren, a man who abuses his girlfriend. Ink ends up being captured by men associated with a man named Sezin, but she escapes and kills them. The narrative then circles back to the news, where Miranda Kent is reporting on the chaos that is unfolding in the city. The Interrogator from the beginning of the story is revealed to be corrupt. The story culminates in a final confrontation at an abandoned television studio where Hitman Sam is sent to kill Miranda, but she is revealed to be a contract killer, codenamed Scarlet Fever, and uses the help of Ink, Ruby, and Pleather to kill Hitman Sam and his henchmen. The story ends with Chief of Police, who is revealed to be the corrupt Interrogator, being confronted by Tony. Chulo is then run over by Ruby on her motorcycle.",
        "production_scheme": {
            "genre": "This script blends several genres, primarily action, crime, and neo-noir, with elements of dark comedy and revenge thriller. There is a strong emphasis on stylized violence and a pulpy, comic-book feel. The story follows multiple female characters who each have their own brand of vigilante justice. The dialogue is often sarcastic, witty, and sometimes over-the-top, leaning into the B-movie aesthetic.\n\n",
            "budget": "The budget for this script would likely be moderately high, owing to the multiple locations, action sequences, and special effects. The script would require a significant amount of practical stunts, vehicle work, and gunplay. The need for multiple sets, including a news studio, a chop shop, a dogfighting arena, and a variety of urban locations, would contribute to the cost. The use of custom motorcycles and various vehicles would also add to the budget. The casting of multiple actors, including several female leads, would also have a significant impact on the overall cost. In addition, special effects, squibs, and makeup effects will be needed to visualize the violence.",
            "locale": "The primary locale for this script is Los Angeles, California, specifically Hollywood and surrounding areas. The story utilizes a mix of urban environments, including seedy bars, chop shops, high-end condos, and abandoned buildings. The specific locations include a news studio, a pet store, a custom motorcycle shop, a coffee shop, and various residential spaces. The script also features a dogfighting ring, which likely requires a large, industrial space. The setting is contemporary, with references to modern technology like cell phones and social media, but also incorporates a somewhat retro aesthetic with the use of older vehicles and a 70's rock soundtrack.\n\n",
            "time_period": "The time period is present-day, as indicated by references to modern technology, current news broadcasts, and contemporary social issues. The story unfolds over a couple of days and nights, with flashbacks to the past to establish character motivations and history. There's a sense of timelessness to the action, drawing inspiration from classic crime films and exploitation cinema, but the technology and social commentary firmly place it in the present.\n\n"
        },
        "character_breakdowns": [
            {
                "name": "Miranda Kent",
                "type": "lead",
                "comps": [
                    "Amy Adams",
                    "Julianne Moore",
                    "Naomi Watts"
                ],
                "gender": "female",
                "age_range": "late 30s",
                "ethnicity": "white",
                "description": "A driven and ambitious news anchor, secretly the leader of a vigilante group called 'Scarlet Fever'. She is intelligent and capable, but also ruthless when necessary."
            },
            {
                "name": "Ruby Chopper",
                "type": "lead",
                "comps": [
                    "Kristen Stewart",
                    "Rooney Mara",
                    "Abbey Lee"
                ],
                "gender": "female",
                "age_range": "late 20s",
                "ethnicity": "white",
                "description": "A bad-ass biker with a dark past. She seeks revenge on her childhood abuser. She is tough and fearless, with a strong sense of justice."
            },
            {
                "name": "Pleather",
                "type": "lead",
                "comps": [
                    "Anya Taylor-Joy",
                    "Elle Fanning",
                    "Florence Pugh"
                ],
                "gender": "female",
                "age_range": "early 20s",
                "ethnicity": "white",
                "description": "A seemingly meek pet store clerk with a hidden side. She's a vegan vigilante who targets animal abusers. She is resourceful and skilled in combat."
            },
            {
                "name": "Ink",
                "type": "lead",
                "comps": [
                    "Lashana Lynch",
                    "Kiki Layne",
                    "Teyonah Parris"
                ],
                "gender": "female",
                "age_range": "late 20s",
                "ethnicity": "African American",
                "description": "A skilled tattoo artist with a talent for combat. She targets men who abuse women. She's fiercely independent and loyal to her cause."
            },
            {
                "name": "Carlos",
                "type": "supporting",
                "comps": [
                    "Benicio Del Toro",
                    "Danny Trejo",
                    "Luis Guzmán"
                ],
                "gender": "male",
                "age_range": "50s",
                "ethnicity": "Latino",
                "description": "A rugged bartender with a criminal past. He is an informant for the Interrogator and a supplier of guns to the women."
            },
            {
                "name": "Chulo (Pappi Chulo)",
                "type": "supporting",
                "comps": [
                    "Diego Luna",
                    "Gael García Bernal",
                    "Oscar Isaac"
                ],
                "gender": "male",
                "age_range": "late 20s",
                "ethnicity": "Latino",
                "description": "A drug dealer and Ruby's childhood abuser. He is arrogant and cruel, ultimately meeting a violent end."
            },
            {
                "name": "Sergeant Tony Catone",
                "type": "supporting",
                "comps": [
                    "Bryan Cranston",
                    "John Hamm",
                    "Jon Bernthal"
                ],
                "gender": "male",
                "age_range": "50s",
                "ethnicity": "white",
                "description": "A seasoned, sharp and savvy, but somewhat cynical detective. He is investigating the crimes and has a history with both Carlos and Miranda."
            },
            {
                "name": "The Rookie (Don Barnes)",
                "type": "supporting",
                "comps": [
                    "Jesse Plemons",
                    "Michael Cera",
                    "Nicholas Braun"
                ],
                "gender": "male",
                "age_range": "early 30s",
                "ethnicity": "white",
                "description": "A clean-cut detective, eager to prove himself. He is intelligent but lacks experience. He is paired with Tony and is consistently made fun of."
            },
            {
                "name": "The Interrogator/Chief of Police",
                "type": "supporting",
                "comps": [
                    "Michael Shannon",
                    "Stephen Lang",
                    "Ray Liotta"
                ],
                "gender": "male",
                "age_range": "late 50s",
                "ethnicity": "white",
                "description": "A stern and corrupt figure, revealed to be the Chief of Police. He is involved in the criminal underworld and is the main antagonist."
            },
            {
                "name": "Hitman Sam",
                "type": "supporting",
                "comps": [
                    "J.K. Simmons",
                    "Stephen Root",
                    "John Carroll Lynch"
                ],
                "gender": "male",
                "age_range": "60s",
                "ethnicity": "white",
                "description": "A tired and experienced hitman hired to eliminate Miranda. He is calm and calculating, but ultimately outmatched."
            }
        ],
        "comprehensive_synopsis": "The movie opens with a news report featuring Miranda Kent, a news anchor with a shoulder cast, somberly delivering the news after a violent incident at her station. The story then flashes back to \"one day earlier,\" where we meet an interrogator, shrouded in darkness, questioning Carlos, a beaten and bloodied man. The interrogator uses threats to Carlos's daughter to force him to tell the story behind the violence. Carlos begins with Ruby, a young girl who was victimized by a bully named Chulo. \n\n The narrative shifts to a flashback of Ruby, as a child, riding her tricycle when Chulo steals it, leaving her heartbroken and enraged. The story then jumps to present day, introducing Ruby Chopper, a tough, leather-clad woman with the same hate-filled eyes as her childhood self. She rides her Harley to a seedy bar called The Trash Pit. Inside, she encounters Carlos, now a bartender, and a drug dealer named Pappi Chulo, who is the same bully from her past. \n\n Recognizing Chulo, Ruby is consumed by rage and leaves to retrieve a shotgun. She returns to the bar and kills Chulo's bodyguards and companions, save one who tells her that Chulo is at the Epoque Hotel penthouse. She leaves the bar and gets into a taxi, holding the cab driver at shotgun point to take her to the hotel. Meanwhile, Chulo is at a chop shop trying to get rid of Ruby’s stolen bike. He's treated disrespectfully and finally leaves, taking the bike with him. \n\n Ruby arrives at Chulo’s penthouse suite and finds his bodyguard dead. She confronts Chulo, who doesn't initially recognize her. She reminds him of the tricycle he stole, triggering his memory. They have a tense conversation where she demands her tricycle back, which he obviously doesn't have. She tells him to get her $500k by sunrise or she will kill him. He leaves, and Ruby sits down and watches the news, seeing a report about the incident at the bar.\n\n The story then shifts to Pleather, a seemingly innocent pet store clerk with a hidden violent side. She is visited by Franco, who works for Carlos, and they make an exchange of weapons. At her home, Pleather tortures a man, Tim Huston, who is tied up with a dog collar. Two detectives, Tony Catone and a rookie, visit Pleather at her home, questioning her about a customer. The rookie notices that the cat has a tag that says \"Property of Tim Huston\" and realizes he is a missing person. Before they can ask more questions, they get a call to the Trash Pit crime scene. \n\n Pleather then breaks into the home of Tino, a customer who abused his cat, and ties him to the toilet. She is about to torture him when he mentions a dogfighting tournament. She takes him there, where she sees how the dogs are abused, and she is enraged. At the tournament, Tino owes money to Sol Fishman and to the Castangelo family. The Don Castangelo arrives at the dogfight, and there is a tense standoff. Pleather intervenes, and everyone agrees to put down their guns and have the dogs fight. However, once the dogs are released, Pleather reveals she has an uzi and kills everyone at the dogfight. She leaves, taking the dogs with her. \n\n The narrative then introduces Ink, a tattooed woman who is tracking down and tattooing men who abuse women. She knocks out a man named Darren and tattoos “I BEAT WOMEN” on his forehead. She steals his Breaking Away DVD. At her apartment, her friend Denise shows her the news report from the Trash Pit. Ink leaves to go to the bar, where she is kidnapped by two men, Sezin and Rafi. Sezin and Rafi tie her up, and Rafi reveals he is a collector of DVDs. They start discussing the movie Black Christmas, which Ink had stolen from Rafi. \n\n Suddenly, Casey Reardon, a crazed actor, breaks into their condo and demands money to finance a movie he is producing. He unties Ink, and she convinces him to give her the gun. Sezin returns, and he shoots Casey, and Ink shoots Sezin and Rafi, killing them all. She leaves and returns to Carlos with the gun. The interrogator questions Carlos about Ink, and Carlos reveals she was a mistake, as she tattooed the wrong person. \n\n The interrogator also reveals that Carlos is supplying the women with guns and that he was getting kickbacks from Chulo and Sezin. Carlos refuses to give the name of the ringleader, so he is killed. The scene shifts to the police station, where Tony and the Rookie are discussing the case and the Rookie is trying to get Tony to stop calling him \"Rookie\". Tony is called to a custom motorcycle shop. There, he meets Ruby, disguised as Ron Chelis, the owner of the shop, and they have a strange connection. \n\n The Rookie and Ruby have a clash, and the detectives have to leave. They both talk about the full moon, and the myth that it increases crime. Tony reveals that it is actually opportunity that increases crime, not the moon. They leave, and the scene shifts to a commercial for the Miranda Kent Community Outreach Program, which seems to be helping at-risk females. The Interrogator is watching the commercial and realizes Miranda is involved. He calls a hitman and orders a hit on her. \n\n Back at the news station, Miranda is distraught at the composite sketch of Ruby. She is confronted by her boss, Bob, about saying the word “shit” on live TV. She puts him in his place and goes to her office, where she meets Ink. The two discuss the events, and Miranda reveals her name is Scarlet. She says she will always fix it, because she is the voice of the news. Bob comes to her door and she lies to him about a tip about a triple homicide, so she can go on location. \n\n At Sezin’s condo, Tony and the Rookie discover Rafi has the word “Rapist” tattooed on his forehead. Tony believes that it is the tattoo artist from previous cases. Outside, Tony sees Miranda arrive, and they have a conversation. They are interrupted by the Rookie’s radio, which reports more homicides. They leave, and the scene cuts to Hitman Sam going to Bob’s office and the news station. He holds Bob at gunpoint and gets the number to Miranda’s cell phone. \n\n The scene then cuts to the live opening to the 10 o’clock news. The three hitmen kill all the reporters. Miranda is in shock at the crime scene when she gets a call from the interrogator, who reveals he knows she is the ringleader. She makes a deal to meet him at the old Channel 12 studio. She tells Henry to get the keys to the news van. She looks at the news, and Donna Pasaro is reporting on the dogfight murders, not the shooting at the news station. She drives to the old studio. \n\n At the old studio, Hitman Sam is waiting for her. He shoots her in the shoulder. She pretends to be ready to give up, but she jumps and grabs her gun. They have a standoff, where Hitman Sam reveals he is not alone. Three more hitmen surround her. She calls for the house lights, and Ink, Ruby, and Pleather arrive with AK-47s. The women kill all the hitmen, including Sam. Scarlet answers Sam’s phone, and she threatens the interrogator. \n\n The scene shifts to the Chief’s office. The Chief is on the phone and has a blood stain on his collar. Tony comes in to talk to the Chief, and Tony notices the blood. The Chief, who is the interrogator, is the one who has been pulling the strings. Tony leaves, and the scene shifts to the women leaving the old studio. The final scene shows Ruby running over Chulo with her motorcycle and saying \"Time's up, Pappi.\" The movie ends with a title card that reads “The Bad Ass Girls”. "
    },
    "script_file_path": "users/b2f34fc4-dcf5-4b7c-97e7-c1b3ba19ce8f/content/4d90ca06-8439-4e13-93f8-80dd2a0f483f/uploads/script_Bad Ass Girls_2024.pdf",
    "solicitationCode": ""
}